### DataFrame 행/열 삭제

In [1]:
import pandas as pd

In [2]:
data = {'name':['홍길동', '마징가', '원더우먼'],
        'job':['의적', '로봇', '영웅'],
        'gender':['남', '남', '여'],
        'age':[100, 200, 300],
        'height':[180, 300, 200]}

In [3]:
dataDF = pd.DataFrame(data)

In [4]:
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

- 실습 :  1번 행을 삭제 : 변수명.drop()
    * 변수명.drop(label, axis=0) : axis의 설정값에 따라 행 또는 열 삭제 진행
    * 변수명.drop() : 지정된 인덱스의 값을 삭제

In [5]:
# 1개 행 삭제 -> 기본값 : 행 삭제, 원본변경x
dataDF_2 = dataDF.drop(1)

In [6]:
dataDF_2

   name job gender  age  height
0   홍길동  의적      남  100     180
2  원더우먼  영웅      여  300     200

In [7]:
# 2개 행 삭제
dataDF_3 = dataDF.drop([0, 2])

In [8]:
dataDF_3

  name job gender  age  height
1  마징가  로봇      남  200     300

- 실습 열/컬럼 삭제 : 변수명.drop( ,axis=1 또는 axis = columns) 축을 지정해줘야함. 기본 0
    * 변수명.drop(label, axis=0) : axis의 설정값에 따라 행 또는 열 삭제 진행
    * 변수명.drop(, axis=1) : 지정된 인덱스의 값을 삭제

In [9]:
# age 커럼을 삭제하고 싶음
dataDF_4 = dataDF.drop('age', axis=1)

In [10]:
dataDF_4

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [11]:
# gander, heignt 컬럼 삭제
dataDF_5 = dataDF.drop(['gender', 'height'], axis=1)

In [12]:
dataDF_5

   name job  age
0   홍길동  의적  100
1   마징가  로봇  200
2  원더우먼  영웅  300

In [14]:
# 슬라이싱
# 행인지 열인지 axis= 명시 해줘야함.
dataDF.drop(columns=dataDF.columns[::2])

  job  age
0  의적  100
1  로봇  200
2  영웅  300

In [15]:
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200